/*
位元運算
C 語言提供了一些 operators，
讓我們能用更低階的方式存取和修改資料。
這些 operators 包括：
& AND  ( 1&1 = 1。其他都 = 0 )
| OR   ( 1|1 1|0 0|1 都 = 1。0|0 = 0 )
^ XOR  ( 1,1以及0,0 = 0。1,0及0,1 = 1 )
~ NOT(One's compliment補數)  ( 1=0。0=1 )
>> Right shift ( 將位元向右移 )
<< Left shift  ( 將位元向左移 )

這些跟條件判斷(&&、||)很像，但這些是用在位元運算的operators
*/

/*
譬如：
6: 0110 | ~6:1001
4: 0100 | ~4:1011
--------|
&: 0100 |
|: 0110
^: 0010

*/
#include <stdio.h>
void dispBits(unsigned int val) //int 是32位元，所以用32位來寫
{
    int i;
    /*
    當一個數字x被往左移1位元，原先的位子會被填上0
    即一個數若被往左移1，就相當於該數*2
    ex:
    6: 0110
    6 << 1 (6往左移1位元)
    => 1100 = 12
    也就是被*2了
    */
    unsigned int mask = 1 << 31;
    //所以這表示1要乘2 31次，也就是2的31次方
//    10000000000000000000000000000...0000 (31個0)
//val=00000000000000000000000000000...0110 (val=6)
    for(i=0; i<32; i++)
    {
        if((mask & val) != 0)
        {
            printf("1");
        }
        else
        {
            printf("0");
        }
        mask = mask >> 1; //把1往左移
//    01000000000000000000000000000...0000
//val=00000000000000000000000000000...0110 (val=6)
// &  00000000000000000000000000000...0100
    }
    printf("\n");
}
int main()
{
    dispBits(6);
    dispBits(4);
    dispBits(4 & 6);
    dispBits(4 | 6);
    dispBits(4 ^ 6);

    return 0;
}
